// Добрий день! Зробила два варіанти кода. Оба працюють, але оба криво. В першому не працює else так як треба, а в другому я не знаю як всі alert вивести одним повідомленням. На жаль, відповіді я не знайшла. Тому буду дуже вдячна, якщо ви мені поясните де я помиляюсь в обох випадках.

let year = prompt('В якому році ви народились?');

let messageYear = (2022-+year);

let city = prompt('В якому місті ти живеш?');

let messageCity = (city === 'Київ') ? 'Ти живеш у столиці України':
  (city === 'Вашингтон') ? 'Ти живеш у столиці США':
  (city === 'Лондон') ? 'Ти живеш у столиці Великобританії':
  (city) ? 'Ти живеш у місті ' + city:
  'Шкода, що Ви не захотіли ввести своє місто.';

let sport = prompt('Який вид спорту тобі подобається більше: футбол, баскетбол чи хокей?');

let messageSport = (sport === 'футбол') ? 'Круто! Хочеш стати як Андрій Шевченко?':
  (sport === 'баскетбол') ? 'Круто! Хочеш стати як Олексій Лень?':
  (sport === 'хокей') ? 'Круто! Хочеш стати як Вейн Грецкі?':
  'Шкода, що Ви не захотіли обрати вид спорту.';

alert(`Отже тобі ${messageYear} років. ${messageCity}. ${messageSport}`);



// Другий варіант



// let year = prompt('В якому році ви народились?');

// if (year) {
//     alert('Тобі '+ (2022-+year) +' років!');
// } else {
//     alert('Шкода, що Ви не захотіли ввести свій(ю) рік народження.');
// }

// let city = prompt('В якому місті ти живеш?');

// if (city === 'Київ') {
//   alert( 'Ти живеш у столиці України' );
// } else if (city === 'Вашингтон') {
//     alert( 'Ти живеш у столиці США' );
// } else if (city === 'Лондон') {
//     alert( 'Ти живеш у столиці Великобританії' );
// } else if (city) {
//     alert( 'Ти живеш у місті ' + city );
// } else {
//   alert( 'Шкода, що Ви не захотіли ввести своє місто.' );
// }

// let sport = prompt('Який вид спорту тобі подобається быльше: футбол, баскетбол чи хокей?');

// if (sport === 'футбол') {
//   alert( 'Круто! Хочеш стати як Андрій Шевченко?' );
// } else if (sport === 'баскетбол') {
//     alert( 'Круто! Хочеш стати як Олексій Лень?' );
// } else if (sport === 'хокей') {
//     alert( 'Круто! Хочеш стати як Вейн Грецкі?' );
// } else {
//   alert( 'Шкода, що Ви не захотіли обрати вид спорту.' );
// }